[
    {
        "id": 27,
        "dateCreated": "6/1/2018",
        "dateEdited": "6/1/2018",
        "headerText": "This is the spiel for the header",
        "sections": [
            {
                "type": "post_list",
                "title": "Professionally",
                "posts": [
                    {
                        "type": "blog",
                        "blog": "12"
                    },
                    {
                        "type": "anecdote",
                        "anecdote": "I've spent some time in the games industry as a full-stack web systems engineer, provided consultancy and design work for charity initiatives, and assisted research projects in maintenance and data organisation."
                    },
                    {
                        "type": "blog",
                        "blog": "12"
                    },
                    {
                        "type": "blog",
                        "blog": "12"
                    },
                    {
                        "type": "blog",
                        "blog": "12"
                    }
                ]
            },
            {
                "type": "text_block",
                "theme": "dark",
                "content": [
                    {
                        "position": "left",
                        "text": "<p>This is a bit where I pander to a specific demographic - perhaps there's a header, perhaps I'm simply talking about something that bears relevance to the above or below. Whatever the case, it's intended to give a more personable insight into what I'm doing. Perhaps it simply states my current employment and what I'm seeking.</p><p>There should be a break, as I'm wont to avoid paragraphs despite my experience typesetting.</p>"
                    },
                    {
                        "position": "right",
                        "text": "<h1>Looking for work</h1>"
                    }
                ]
            },
            {
                "type": "post_list",
                "title": "Released Projects",
                "posts": [
                    {
                        "type": "blog",
                        "blog": "12"
                    },
                    {
                        "type": "blog",
                        "blog": "12"
                    },
                    {
                        "type": "blog",
                        "blog": "12"
                    }
                ]
            },
            {
                "type": "endorsement",
                "post": "88"
            },
            {
                "type": "post_list",
                "title": "Released Projects",
                "posts": [
                    {
                        "type": "blog",
                        "blog": "12"
                    },
                    {
                        "type": "blog",
                        "blog": "12"
                    },
                    {
                        "type": "anecdote",
                        "anecdote": "<p>I've spoken at conferences, and I represent my degree discipline in ambassadorship and outreach teaching activities. I also do freelance photography!</p>"
                    },
                    {
                        "type": "blog",
                        "blog": "12"
                    },
                    {
                        "type": "blog",
                        "blog": "12"
                    }
                ]
            },
            {
                "type": "text_block",
                "theme": "light",
                "content": [
                    {
                        "position": "full",
                        "text": "<h1>I make mistakes</h1><p>So I'm documenting them on my blog in order to learn from them. Most of the peskier ones end up being pretty useful. As I do work, I've been writing anecdotal posts that log my experiences wrestling with new and exciting problems; I also have recurring series'. Whether you came wearing your design, programming or business hat, I think you'll find something useful.</p><p>I'm currently reading 'Deep Learning' by Ian Goodfellow</p>"
                    }
                ]
            }
        ]
    }
]